ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_SYSPLLCFG0" width="32" offset="0x1120" description="SYSPLL reference and output configuration">
        <bitfield id="ENABLECLK0" description="ENABLECLK0 enables or disables the SYSPLLCLK0 output." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SYSPLLCLK0 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="SYSPLLCLK0 is enabled"/>
        </bitfield>
        <bitfield id="ENABLECLK1" description="ENABLECLK1 enables or disables the SYSPLLCLK1 output." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SYSPLLCLK1 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="SYSPLLCLK1 is enabled"/>
        </bitfield>
        <bitfield id="RDIVCLK1" description="RDIVCLK1 sets the final divider for the SYSPLLCLK1 output." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="CLK1DIV2" value="0x0" description="SYSPLLCLK1 is divided by 2"/>
            <bitenum id="CLK1DIV4" value="0x1" description="SYSPLLCLK1 is divided by 4"/>
            <bitenum id="CLK1DIV6" value="0x2" description="SYSPLLCLK1 is divided by 6"/>
            <bitenum id="CLK1DIV8" value="0x3" description="SYSPLLCLK1 is divided by 8"/>
            <bitenum id="CLK1DIV10" value="0x4" description="SYSPLLCLK1 is divided by 10"/>
            <bitenum id="CLK1DIV12" value="0x5" description="SYSPLLCLK1 is divided by 12"/>
            <bitenum id="CLK1DIV14" value="0x6" description="SYSPLLCLK1 is divided by 14"/>
            <bitenum id="CLK1DIV16" value="0x7" description="SYSPLLCLK1 is divided by 16"/>
            <bitenum id="CLK1DIV18" value="0x8" description="SYSPLLCLK1 is divided by 18"/>
            <bitenum id="CLK1DIV20" value="0x9" description="SYSPLLCLK1 is divided by 20"/>
            <bitenum id="CLK1DIV22" value="0xA" description="SYSPLLCLK1 is divided by 22"/>
            <bitenum id="CLK1DIV24" value="0xB" description="SYSPLLCLK1 is divided by 24"/>
            <bitenum id="CLK1DIV26" value="0xC" description="SYSPLLCLK1 is divided by 26"/>
            <bitenum id="CLK1DIV28" value="0xD" description="SYSPLLCLK1 is divided by 28"/>
            <bitenum id="CLK1DIV30" value="0xE" description="SYSPLLCLK1 is divided by 30"/>
            <bitenum id="CLK1DIV32" value="0xF" description="SYSPLLCLK1 is divided by 32"/>
        </bitfield>
        <bitfield id="MCLK2XVCO" description="MCLK2XVCO selects the SYSPLL output which is sent to the HSCLK mux for use by MCLK." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The SYSPLLCLK0 output is sent to the HSCLK mux"/>
            <bitenum id="ENABLE" value="0x1" description="The SYSPLLCLK2X output is sent to the HSCLK mux"/>
        </bitfield>
        <bitfield id="RDIVCLK2X" description="RDIVCLK2X sets the final divider for the SYSPLLCLK2X output." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="CLK2XDIV1" value="0x0" description="SYSPLLCLK1 is divided by 1"/>
            <bitenum id="CLK2XDIV2" value="0x1" description="SYSPLLCLK1 is divided by 2"/>
            <bitenum id="CLK2XDIV3" value="0x2" description="SYSPLLCLK1 is divided by 3"/>
            <bitenum id="CLK2XDIV4" value="0x3" description="SYSPLLCLK1 is divided by 4"/>
            <bitenum id="CLK2XDIV5" value="0x4" description="SYSPLLCLK1 is divided by 5"/>
            <bitenum id="CLK2XDIV6" value="0x5" description="SYSPLLCLK1 is divided by 6"/>
            <bitenum id="CLK2XDIV7" value="0x6" description="SYSPLLCLK1 is divided by 7"/>
            <bitenum id="CLK2XDIV8" value="0x7" description="SYSPLLCLK1 is divided by 8"/>
            <bitenum id="CLK2XDIV9" value="0x8" description="SYSPLLCLK1 is divided by 9"/>
            <bitenum id="CLK2XDIV10" value="0x9" description="SYSPLLCLK1 is divided by 10"/>
            <bitenum id="CLK2XDIV11" value="0xA" description="SYSPLLCLK1 is divided by 11"/>
            <bitenum id="CLK2XDIV12" value="0xB" description="SYSPLLCLK1 is divided by 12"/>
            <bitenum id="CLK2XDIV13" value="0xC" description="SYSPLLCLK1 is divided by 13"/>
            <bitenum id="CLK2XDIV14" value="0xD" description="SYSPLLCLK1 is divided by 14"/>
            <bitenum id="CLK2XDIV15" value="0xE" description="SYSPLLCLK1 is divided by 15"/>
            <bitenum id="CLK2XDIV16" value="0xF" description="SYSPLLCLK1 is divided by 16"/>
        </bitfield>
        <bitfield id="RDIVCLK0" description="RDIVCLK0 sets the final divider for the SYSPLLCLK0 output." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="CLK0DIV2" value="0x0" description="SYSPLLCLK0 is divided by 2"/>
            <bitenum id="CLK0DIV4" value="0x1" description="SYSPLLCLK0 is divided by 4"/>
            <bitenum id="CLK0DIV6" value="0x2" description="SYSPLLCLK0 is divided by 6"/>
            <bitenum id="CLK0DIV8" value="0x3" description="SYSPLLCLK0 is divided by 8"/>
            <bitenum id="CLK0DIV10" value="0x4" description="SYSPLLCLK0 is divided by 10"/>
            <bitenum id="CLK0DIV12" value="0x5" description="SYSPLLCLK0 is divided by 12"/>
            <bitenum id="CLK0DIV14" value="0x6" description="SYSPLLCLK0 is divided by 14"/>
            <bitenum id="CLK0DIV16" value="0x7" description="SYSPLLCLK0 is divided by 16"/>
            <bitenum id="CLK0DIV18" value="0x8" description="SYSPLLCLK0 is divided by 18"/>
            <bitenum id="CLK0DIV20" value="0x9" description="SYSPLLCLK0 is divided by 20"/>
            <bitenum id="CLK0DIV22" value="0xA" description="SYSPLLCLK0 is divided by 22"/>
            <bitenum id="CLK0DIV24" value="0xB" description="SYSPLLCLK0 is divided by 24"/>
            <bitenum id="CLK0DIV26" value="0xC" description="SYSPLLCLK0 is divided by 26"/>
            <bitenum id="CLK0DIV28" value="0xD" description="SYSPLLCLK0 is divided by 28"/>
            <bitenum id="CLK0DIV30" value="0xE" description="SYSPLLCLK0 is divided by 30"/>
            <bitenum id="CLK0DIV32" value="0xF" description="SYSPLLCLK0 is divided by 32"/>
        </bitfield>
        <bitfield id="SYSPLLREF" description="SYSPLLREF selects the system PLL (SYSPLL) reference clock source." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SYSOSC" value="0x0" description="SYSPLL reference is SYSOSC"/>
            <bitenum id="HFCLK" value="0x1" description="SYSPLL reference is HFCLK"/>
        </bitfield>
        <bitfield id="ENABLECLK2X" description="ENABLECLK2X enables or disables the SYSPLLCLK2X output." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SYSPLLCLK2X is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="SYSPLLCLK2X is enabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLCFG1" width="32" offset="0x1124" description="SYSPLL reference and feedback divider">
        <bitfield id="PDIV" description="PDIV selects the SYSPLL reference clock prescale divider." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="REFDIV1" value="0x0" description="SYSPLLREF is not divided"/>
            <bitenum id="REFDIV2" value="0x1" description="SYSPLLREF is divided by 2"/>
            <bitenum id="REFDIV4" value="0x2" description="SYSPLLREF is divided by 4"/>
            <bitenum id="REFDIV8" value="0x3" description="SYSPLLREF is divided by 8"/>
        </bitfield>
        <bitfield id="QDIV" description="QDIV selects the SYSPLL feedback path divider." begin="14" end="8" width="7" rwaccess="R/W">
            <bitenum id="INVALID" value="0x0" description="Divide-by-one is not a valid QDIV option"/>
            <bitenum id="QDIVMIN" value="0x1" description="Feedback path is divided by 2"/>
            <bitenum id="QDIVMAX" value="0x7E" description="Feedback path is divided by 127 (0x7E)"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLPARAM0" width="32" offset="0x1128" description="SYSPLL PARAM0 (load from FACTORY region)">
        <bitfield id="CPCURRENT" description="Charge pump current" begin="21" end="16" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAPBOVERRIDE" description="CAPBOVERRIDE controls the override for Cap B" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Cap B override disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Cap B override enabled"/>
        </bitfield>
        <bitfield id="STARTTIME" description="Startup time from enable to locked clock, in 1us resolution" begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAPBVAL" description="Override value for Cap B" begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="STARTTIMELP" description="Startup time from low power mode exit to locked clock, in 1us resolution" begin="14" end="8" width="7" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLPARAM1" width="32" offset="0x112C" description="SYSPLL PARAM1 (load from FACTORY region)">
        <bitfield id="LPFCAPA" description="Loop filter Cap A" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="LPFRESC" description="Loop filter Res C" begin="31" end="24" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="LPFRESA" description="Loop filter Res A" begin="17" end="8" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLPARAM2" width="32" offset="0x1130" description="SYSPLL PARAM2 (load from FACTORY region)">
        <bitfield id="RNGFIXVCOIBIASCFG" description="0 value for Temperature Compensation R addition" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LPFCAPC" description="Loop filter Cap C" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
    </register>
