ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_SYSPLLLDOCTL" width="32" offset="0x1134" description="SYSPLL LDO CTL (load from FACTORY region)">
        <bitfield id="LDOCTLLOWV" description="LDO Configurability" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLLDOPROG" width="32" offset="0x1138" description="SYSPLL LDO VOUT PROG (load from FACTORY region)">
        <bitfield id="LDOVOUTPROGLOWV" description="HPLL LDO Vout Prog" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_GENCLKEN" width="32" offset="0x113C" description="General clock enable control">
        <bitfield id="EXTDIVMCLK" description="EXTDIVMCLK selects the divider value for the divider for the PLL Source MCLK." begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="DIV2" value="0x0" description="CLK_OUT source is divided by 2"/>
            <bitenum id="DIV4" value="0x1" description="CLK_OUT source is divided by 4"/>
            <bitenum id="DIV6" value="0x2" description="CLK_OUT source is divided by 6"/>
            <bitenum id="DIV8" value="0x3" description="CLK_OUT source is divided by 8"/>
            <bitenum id="DIV10" value="0x4" description="CLK_OUT source is divided by 10"/>
            <bitenum id="DIV12" value="0x5" description="CLK_OUT source is divided by 12"/>
            <bitenum id="DIV14" value="0x6" description="CLK_OUT source is divided by 14"/>
            <bitenum id="DIV16" value="0x7" description="CLK_OUT source is divided by 16"/>
        </bitfield>
        <bitfield id="MFPCLKEN" description="MFPCLKEN tied 0, since DAC is not present" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="MFPCLK is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="MFPCLK is enabled"/>
        </bitfield>
        <bitfield id="I2SPLLCLKDIVEN" description="I2SPLLCLKDIVEN enables or disables the divider function of the PLL Source to I2S." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="PASSTHRU" value="0x0" description="CLock divider is disabled (passthrough, I2SPLLCLKDIV is not applied)"/>
            <bitenum id="ENABLE" value="0x1" description="Clock divider is enabled (I2SPLLCLKDIV is applied)"/>
        </bitfield>
        <bitfield id="EXCLKEN" description="EXCLKEN enables the CLK_OUT external clock output block." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="CLK_OUT block is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="CLK_OUT block is enabled"/>
        </bitfield>
        <bitfield id="I2SPLLCLKDIVCFG" description="I2SPLLCLKDIVCFG selects the divider value for the divider for the PLL Source to CAN." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="DIV4" value="0x0" description="CLK_OUT source is divided by 4"/>
            <bitenum id="DIV8" value="0x1" description="CLK_OUT source is divided by 8"/>
            <bitenum id="DIV12" value="0x2" description="CLK_OUT source is divided by 12"/>
            <bitenum id="DIV16" value="0x3" description="CLK_OUT source is divided by 16"/>
        </bitfield>
        <bitfield id="MCLKEXTDIVEN" description="MCLKEXTDIVEN enables or disables the divider function of the PLL Source to MCLK." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="PASSTHRU" value="0x0" description="CLock divider is disabled (passthrough, EXTDIVMCLK is not applied)"/>
            <bitenum id="ENABLE" value="0x1" description="Clock divider is enabled (EXTDIVMCLK is applied)"/>
        </bitfield>
        <bitfield id="EXTDIVCAN" description="EXTDIVCAN selects the divider value for the divider for the PLL Source to CAN." begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="DIV2" value="0x0" description="CLK_OUT source is divided by 2"/>
            <bitenum id="DIV4" value="0x1" description="CLK_OUT source is divided by 4"/>
            <bitenum id="DIV6" value="0x2" description="CLK_OUT source is divided by 6"/>
            <bitenum id="DIV8" value="0x3" description="CLK_OUT source is divided by 8"/>
            <bitenum id="DIV10" value="0x4" description="CLK_OUT source is divided by 10"/>
            <bitenum id="DIV12" value="0x5" description="CLK_OUT source is divided by 12"/>
            <bitenum id="DIV14" value="0x6" description="CLK_OUT source is divided by 14"/>
            <bitenum id="DIV16" value="0x7" description="CLK_OUT source is divided by 16"/>
        </bitfield>
        <bitfield id="CANEXTDIVEN" description="CANEXTDIVEN enables or disables the divider function of the PLL Source to CAN." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="PASSTHRU" value="0x0" description="CLock divider is disabled (passthrough, EXTDIVCAN is not applied)"/>
            <bitenum id="ENABLE" value="0x1" description="Clock divider is enabled (EXTDIVCAN is applied)"/>
        </bitfield>
    </register>
    <register id="SYSCTL_GENCLKCFG" width="32" offset="0x1140" description="General clock configuration">
        <bitfield id="HFCLK4MFPCLKDIV" description="HFCLK4MFPCLKDIV selects the divider applied to HFCLK when HFCLK is used as the MFPCLK source.  Integer dividers from /1 to /16 may be selected." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="DIV1" value="0x0" description="HFCLK is not divided before being used for MFPCLK"/>
            <bitenum id="DIV2" value="0x1" description="HFCLK is divided by 2 before being used for MFPCLK"/>
            <bitenum id="DIV3" value="0x2" description="HFCLK is divided by 3 before being used for MFPCLK"/>
            <bitenum id="DIV4" value="0x3" description="HFCLK is divided by 4 before being used for MFPCLK"/>
            <bitenum id="DIV5" value="0x4" description="HFCLK is divided by 5 before being used for MFPCLK"/>
            <bitenum id="DIV6" value="0x5" description="HFCLK is divided by 6 before being used for MFPCLK"/>
            <bitenum id="DIV7" value="0x6" description="HFCLK is divided by 7 before being used for MFPCLK"/>
            <bitenum id="DIV8" value="0x7" description="HFCLK is divided by 8 before being used for MFPCLK"/>
            <bitenum id="DIV9" value="0x8" description="HFCLK is divided by 9 before being used for MFPCLK"/>
            <bitenum id="DIV10" value="0x9" description="HFCLK is divided by 10 before being used for MFPCLK"/>
            <bitenum id="DIV11" value="0xA" description="HFCLK is divided by 11 before being used for MFPCLK"/>
            <bitenum id="DIV12" value="0xB" description="HFCLK is divided by 12 before being used for MFPCLK"/>
            <bitenum id="DIV13" value="0xC" description="HFCLK is divided by 13 before being used for MFPCLK"/>
            <bitenum id="DIV14" value="0xD" description="HFCLK is divided by 14 before being used for MFPCLK"/>
            <bitenum id="DIV15" value="0xE" description="HFCLK is divided by 15 before being used for MFPCLK"/>
            <bitenum id="DIV16" value="0xF" description="HFCLK is divided by 16 before being used for MFPCLK"/>
        </bitfield>
        <bitfield id="MFPCLKSRC" description="Not used in design" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SYSOSC" value="0x0" description="MFPCLK is sourced from SYSOSC"/>
            <bitenum id="HFCLK" value="0x1" description="MFPCLK is sourced from HFCLK"/>
        </bitfield>
        <bitfield id="CANCLKSRC" description="CANCLKSRC selects the CANCLK source." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="HFCLK" value="0x0" description="CANCLK source is HFCLK"/>
            <bitenum id="SYSPLLOUT1" value="0x1" description="CANCLK source is SYSPLLCLK1"/>
        </bitfield>
        <bitfield id="FCCLFCLKSRC" description="FCCLFCLKSRC selects between SYSTEM LFCLK and EXTERNAL SOURCED LFCLK." begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FCCTRIGCNT" description="FCCTRIGCNT specifies the number of trigger clock periods in the trigger window. FCCTRIGCNT=0h (one trigger clock period) up to 1Fh (32 trigger clock periods) may be specified." begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="ANACPUMPCFG" description="ANACPUMPCFG selects the analog mux charge pump (VBOOST) enable method." begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="ONDEMAND" value="0x0" description="VBOOST is enabled on request from a COMP, GPAMP, or OPA"/>
            <bitenum id="ONACTIVE" value="0x1" description="VBOOST is enabled when the device is in RUN or SLEEP mode, or when a COMP/GPAMP/OPA is enabled"/>
            <bitenum id="ONALWAYS" value="0x2" description="VBOOST is always enabled"/>
        </bitfield>
        <bitfield id="FCCSELCLK" description="FCCSELCLK selectes the frequency clock counter (FCC) clock source." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MCLK/4" value="0x0" description="FCC clock is MCLK/4"/>
            <bitenum id="SYSOSC" value="0x1" description="FCC clock is SYSOSC"/>
            <bitenum id="HFCLK" value="0x2" description="FCC clock is HFCLK"/>
            <bitenum id="EXTCLK" value="0x3" description="FCC clock is the CLK_OUT selection"/>
            <bitenum id="SYSPLLCLK0" value="0x4" description="FCC clock is SYSPLLCLK0"/>
            <bitenum id="SYSPLLCLK1" value="0x5" description="FCC clock is SYSPLLCLK1"/>
            <bitenum id="SYSPLLCLK2X" value="0x6" description="FCC clock is SYSPLLCLK2X"/>
            <bitenum id="FCCIN" value="0x7" description="FCC clock is the FCCIN external input"/>
        </bitfield>
        <bitfield id="FCCTRIGSRC" description="FCCTRIGSRC selects the frequency clock counter (FCC) trigger source." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="EXTPIN" value="0x0" description="FCC trigger is the external pin"/>
            <bitenum id="LFCLK" value="0x1" description="FCC trigger is the LFCLK"/>
        </bitfield>
        <bitfield id="FCCLVLTRIG" description="FCCLVLTRIG selects the frequency clock counter (FCC) trigger mode." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="RISE2RISE" value="0x0" description="Rising edge to rising edge triggered"/>
            <bitenum id="LEVEL" value="0x1" description="Level triggered"/>
        </bitfield>
        <bitfield id="EXCLKSRC" description="EXCLKSRC selects the source for the CLK_OUT external clock output block.  ULPCLK and MFPCLK require the CLK_OUT divider (EXCLKDIVEN) to be enabled" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="SYSOSC" value="0x0" description="CLK_OUT is SYSOSC"/>
            <bitenum id="ULPCLK" value="0x1" description="CLK_OUT is ULPCLK (EXCLKDIVEN must be enabled)"/>
            <bitenum id="LFCLK" value="0x2" description="CLK_OUT is LFCLK"/>
            <bitenum id="MFPCLK" value="0x3" description="CLK_OUT is MFPCLK (EXCLKDIVEN must be enabled)"/>
            <bitenum id="HFCLK" value="0x4" description="CLK_OUT is HFCLK"/>
            <bitenum id="SYSPLLOUT1" value="0x5" description="CLK_OUT is SYSPLLCLK1 (SYSPLLCLK1 must be &lt;=48MHz)"/>
        </bitfield>
        <bitfield id="EXCLKDIVVAL" description="EXCLKDIVVAL selects the divider value for the divider in the CLK_OUT external clock output block." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="DIV2" value="0x0" description="CLK_OUT source is divided by 2"/>
            <bitenum id="DIV4" value="0x1" description="CLK_OUT source is divided by 4"/>
            <bitenum id="DIV6" value="0x2" description="CLK_OUT source is divided by 6"/>
            <bitenum id="DIV8" value="0x3" description="CLK_OUT source is divided by 8"/>
            <bitenum id="DIV10" value="0x4" description="CLK_OUT source is divided by 10"/>
            <bitenum id="DIV12" value="0x5" description="CLK_OUT source is divided by 12"/>
            <bitenum id="DIV14" value="0x6" description="CLK_OUT source is divided by 14"/>
            <bitenum id="DIV16" value="0x7" description="CLK_OUT source is divided by 16"/>
        </bitfield>
        <bitfield id="EXCLKDIVEN" description="EXCLKDIVEN enables or disables the divider function of the CLK_OUT external clock output block." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="PASSTHRU" value="0x0" description="CLock divider is disabled (passthrough, EXCLKDIVVAL is not applied)"/>
            <bitenum id="ENABLE" value="0x1" description="Clock divider is enabled (EXCLKDIVVAL is applied)"/>
        </bitfield>
    </register>
    <register id="SYSCTL_PMODECFG" width="32" offset="0x1144" description="Power mode configuration">
        <bitfield id="DSLEEP" description="DSLEEP selects the operating mode to enter upon a DEEPSLEEP request from the CPU." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="STOP mode is entered"/>
            <bitenum id="STANDBY" value="0x1" description="STANDBY mode is entered"/>
            <bitenum id="SHUTDOWN" value="0x2" description="SHUTDOWN mode is entered"/>
            <bitenum id="RESERVED" value="0x3" description="Reserved"/>
        </bitfield>
    </register>
    <register id="SYSCTL_MLDOLPENCFG" width="32" offset="0x1148" description="LDO Configuration Control">
        <bitfield id="SVBPRETDIS" description="Control to disable the disconnect of core LDO from retention for STOP and STANDBY" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="Disconnect the core LDO from retention domain during STOP and STANDBY"/>
            <bitenum id="TRUE" value="0x1" description="Do Not Disconnect the core LDO from retention domain during STOP and STANDBY"/>
        </bitfield>
        <bitfield id="CVLODIS" description="Control to disable lowering the core voltage for STOP and STANDBY" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="Lower Core Voltage for STOP and STANDBY mode"/>
            <bitenum id="TRUE" value="0x1" description="Do Not Lower Core Voltage for STOP and STANDBY mode to provide faster wakeup"/>
        </bitfield>
    </register>
