ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_FCC" width="32" offset="0x1150" description="Frequency clock counter (FCC) count">
        <bitfield id="DATA" description="Frequency clock counter (FCC) count value." begin="21" end="0" width="22" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSCTL_PMULDOSPARECTL" width="32" offset="0x1154" description="LDO Spare Control">
        <bitfield id="sparectrl" description="Spare PMU LDO control for M33" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSCTL_ECO_REG1" width="32" offset="0x1158" description="Sysctl ECO Reg 1">
    </register>
    <register id="SYSCTL_SYSCTL_ECO_REG2" width="32" offset="0x115C" description="Sysctl ECO Reg 2">
    </register>
    <register id="SYSCTL_SRAMBOUNDARY" width="32" offset="0x1178" description="SRAM Write Boundary">
        <bitfield id="ADDR" description="Not used, GSC register is used for SRAM boundary configuration" begin="19" end="5" width="15" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SRAMBOUNDARYHIGH" width="32" offset="0x117C" description="SRAM Write Boundary High">
        <bitfield id="ADDR" description="Not used, GSC register is used for SRAM boundary configuration" begin="19" end="5" width="15" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSTEMCFG" width="32" offset="0x1180" description="System configuration">
        <bitfield id="FLASHECCRSTDIS" description="FLASHECCRSTDIS specifies whether a flash ECC double error detect (DED) will trigger a SYSRST or an NMI." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="Flash ECC DED will trigger a SYSRST"/>
            <bitenum id="TRUE" value="0x1" description="Flash ECC DED will trigger a NMI"/>
        </bitfield>
        <bitfield id="WWDTLP0RSTDIS" description="WWDTLP0RSTDIS specifies whether a WWDT Error Event will trigger a BOOTRST or an NMI." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="WWDTLP0 Error Event will trigger a BOOTRST"/>
            <bitenum id="TRUE" value="0x1" description="WWDTLP0 Error Event will trigger an NMI"/>
        </bitfield>
        <bitfield id="SUPERCAPEN" description="SUPERCAP specifies whether the battery backup system can be powered by a SUPERCAP" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="SUPERCAP Function is not enabled"/>
            <bitenum id="TRUE" value="0x1" description="SUPERCAP Function is not enabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SRAMCFG" width="32" offset="0x1184" description="System SRAM configuration">
        <bitfield id="BANKINITDIS3" description="SRAM BANK3 Initialization" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK3 will Initialize when transitioning from OFF to ON"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK3 will NOT Initialize when transitioning from OFF to ON"/>
        </bitfield>
        <bitfield id="BANKOFF2" description="Not used" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK2 power ON for RUN mode"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK2 power OFF for RUN mode"/>
        </bitfield>
        <bitfield id="BANKINITDIS2" description="SRAM BANK2 Initialization" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK2 will Initialize when transitioning from OFF to ON"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK2 will NOT Initialize when transitioning from OFF to ON"/>
        </bitfield>
        <bitfield id="BANKOFF1" description="Not used" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK1 power ON for RUN mode"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK1 power OFF for RUN mode"/>
        </bitfield>
        <bitfield id="BANKOFF3" description="Not used" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK3 power ON for RUN mode"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK3 power OFF for RUN mode"/>
        </bitfield>
        <bitfield id="BANKINITDIS1" description="SRAM BANK1 Initialization" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK1 will Initialize when transitioning from OFF to ON"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK1 will NOT Initialize when transitioning from OFF to ON"/>
        </bitfield>
    </register>
    <register id="SYSCTL_WRITELOCK" width="32" offset="0x1200" description="SYSCTL register write lockout">
        <bitfield id="ACTIVE" description="ACTIVE controls whether critical SYSCTL registers are write protected or not." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Allow writes to lockable registers"/>
            <bitenum id="ENABLE" value="0x1" description="Disallow writes to lockable registers"/>
        </bitfield>
    </register>
    <register id="SYSCTL_CLKSTATUS" width="32" offset="0x1204" description="Clock module (CKM) status">
        <bitfield id="LFOSCGOOD" description="LFOSCGOOD indicates when the LFOSC startup has completed and the LFOSC is ready for use." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="LFOSC is not ready"/>
            <bitenum id="TRUE" value="0x1" description="LFOSC is ready"/>
        </bitfield>
        <bitfield id="HFCLKGOOD" description="HFCLKGOOD indicates that the HFCLK started correctly.  When the HFXT is started or HFCLK_IN is selected as the HFCLK source,  this bit will be set by hardware if a valid HFCLK is detected, and cleared if HFCLK is not operating within the expected range." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="HFCLK did not start correctly"/>
            <bitenum id="TRUE" value="0x1" description="HFCLK started correctly"/>
        </bitfield>
        <bitfield id="HSCLKDEAD" description="HSCLKDEAD is set by hardware if the selected source for HSCLK was started but did not start successfully." begin="20" end="20" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="The HSCLK source was not started or started correctly"/>
            <bitenum id="TRUE" value="0x1" description="The HSCLK source did not start correctly"/>
        </bitfield>
        <bitfield id="SYSPLLBLKUPD" description="SYSPLLBLKUPD indicates when writes to SYSPLLCFG0/1 and SYSPLLPARAM0/1 are blocked." begin="29" end="29" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="writes to SYSPLLCFG0/1 and SYSPLLPARAM0/1 are allowed"/>
            <bitenum id="TRUE" value="0x1" description="writes to SYSPLLCFG0/1 and SYSPLLPARAM0/1 are blocked"/>
        </bitfield>
        <bitfield id="HFCLKOFF" description="HFCLKOFF indicates if the HFCLK is disabled or was dead at startup.  When the HFCLK is started, HFCLKOFF is cleared by hardware.  Following startup of the HFCLK, if the HFCLK startup monitor determines that the HFCLK was not started correctly, HFCLKOFF is set." begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="HFCLK started correctly and is enabled"/>
            <bitenum id="TRUE" value="0x1" description="HFCLK is disabled or was dead at startup"/>
        </bitfield>
        <bitfield id="HFCLKBLKUPD" description="HFCLKBLKUPD indicates when writes to the HFCLKCLKCFG register are blocked." begin="28" end="28" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="Writes to HFCLKCLKCFG are allowed"/>
            <bitenum id="TRUE" value="0x1" description="Writes to HFCLKCLKCFG are blocked"/>
        </bitfield>
        <bitfield id="HSCLKGOOD" description="HSCLKGOOD is set by hardware if the selected clock source for HSCLK started successfully." begin="21" end="21" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="The HSCLK source did not start correctly"/>
            <bitenum id="TRUE" value="0x1" description="The HSCLK source started correctly"/>
        </bitfield>
        <bitfield id="SYSPLLGOOD" description="SYSPLLGOOD indicates if the SYSPLL started correctly.  When the SYSPLL is started, SYSPLLGOOD is cleared by hardware.  After the startup settling time has expired, the SYSPLL status is tested.  If the SYSPLL started successfully the SYSPLLGOOD bit is set, else it is left cleared." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SYSPLL did not start correctly"/>
            <bitenum id="TRUE" value="0x1" description="SYSPLL started correctly"/>
        </bitfield>
        <bitfield id="ANACLKERR" description="ANACLKERR is set when the device clock configuration does not support an enabled analog peripheral mode and the analog peripheral may not be functioning as expected." begin="31" end="31" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No analog clock errors detected"/>
            <bitenum id="TRUE" value="0x1" description="Analog clock error detected"/>
        </bitfield>
        <bitfield id="HSCLKMUX" description="HSCLKMUX indicates if MCLK is currently sourced from the high-speed clock (HSCLK)." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="SYSOSC" value="0x0" description="MCLK is not sourced from HSCLK"/>
            <bitenum id="HSCLK" value="0x1" description="MCLK is sourced from HSCLK"/>
        </bitfield>
        <bitfield id="LFCLKMUX" description="LFCLKMUX indicates if LFCLK is sourced from the internal LFOSC, the low frequency crystal (LFXT), or the LFCLK_IN digital clock input." begin="7" end="6" width="2" rwaccess="R">
            <bitenum id="LFOSC" value="0x0" description="LFCLK is sourced from the internal LFOSC"/>
            <bitenum id="LFXT" value="0x1" description="LFCLK is sourced from the LFXT (crystal)"/>
            <bitenum id="EXLF" value="0x2" description="LFCLK is sourced from LFCLK_IN (external digital clock  input)"/>
        </bitfield>
        <bitfield id="SYSOSCFREQ" description="SYSOSCFREQ indicates the current SYSOSC operating frequency." begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="SYSOSC32M" value="0x0" description="SYSOSC is at base frequency (32MHz)"/>
            <bitenum id="SYSOSC4M" value="0x1" description="SYSOSC is at low frequency (4MHz)"/>
            <bitenum id="SYSOSCUSER" value="0x2" description="SYSOSC is at the user-trimmed frequency (16 or 24MHz)"/>
            <bitenum id="SYSOSCTURBO" value="0x3" description="Reserved"/>
        </bitfield>
        <bitfield id="LFXTGOOD" description="LFXTGOOD indicates if the LFXT started correctly.  When the LFXT is started, LFXTGOOD is cleared by hardware.  After the startup settling time has expired, the LFXT status is tested.  If the LFXT started successfully the LFXTGOOD bit is set, else it is left cleared." begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="LFXT did not start correctly"/>
            <bitenum id="TRUE" value="0x1" description="LFXT started correctly"/>
        </bitfield>
        <bitfield id="HSCLKSOFF" description="HSCLKSOFF is set when the high speed clock sources (SYSPLL, HFCLK) are disabled or dead.  It is the logical AND of HFCLKOFF and SYSPLLOFF." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SYSPLL, HFCLK, or both were started correctly and remain enabled"/>
            <bitenum id="TRUE" value="0x1" description="SYSPLL and HFCLK are both either off or dead"/>
        </bitfield>
        <bitfield id="FCLMODE" description="FCLMODE indicates if the SYSOSC frequency correction loop (FCL) is enabled." begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="DISABLED" value="0x0" description="SYSOSC FCL is disabled"/>
            <bitenum id="ENABLED" value="0x1" description="SYSOSC FCL is enabled"/>
        </bitfield>
        <bitfield id="CURHSCLKSEL" description="CURHSCLKSEL indicates the current clock source for HSCLK." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="SYSPLL" value="0x0" description="HSCLK is currently sourced from the SYSPLL"/>
            <bitenum id="HFCLK" value="0x1" description="HSCLK is currently sourced from the HFCLK"/>
        </bitfield>
        <bitfield id="CURMCLKSEL" description="CURMCLKSEL indicates if MCLK is currently sourced from LFCLK." begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="NOTLFCLK" value="0x0" description="MCLK is not sourced from LFCLK"/>
            <bitenum id="LFCLK" value="0x1" description="MCLK is sourced from LFCLK"/>
        </bitfield>
        <bitfield id="FCCDONE" description="FCCDONE indicates when a frequency clock counter capture is complete." begin="25" end="25" width="1" rwaccess="R">
            <bitenum id="NOTDONE" value="0x0" description="FCC capture is not done"/>
            <bitenum id="DONE" value="0x1" description="FCC capture is done"/>
        </bitfield>
        <bitfield id="SYSPLLOFF" description="SYSPLLOFF indicates if the SYSPLL is disabled or was dead at startup.  When the SYSPLL is started, SYSPLLOFF is cleared by hardware.  Following startup of the SYSPLL, if the SYSPLL startup monitor determines that the SYSPLL was not started correctly, SYSPLLOFF is set." begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SYSPLL started correctly and is enabled"/>
            <bitenum id="TRUE" value="0x1" description="SYSPLL is disabled or was dead startup"/>
        </bitfield>
        <bitfield id="LFCLKFAIL" description="LFCLKFAIL indicates when the continous LFCLK monitor detects a LFXT or LFCLK_IN clock stuck failure." begin="23" end="23" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No LFCLK fault detected"/>
            <bitenum id="TRUE" value="0x1" description="LFCLK stuck fault detected"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSSTATUS" width="32" offset="0x1208" description="System status information">
        <bitfield id="PKAREADY" description="PKAREADY indicates when the PKA peripheral is ready." begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="PKA is not ready"/>
            <bitenum id="TRUE" value="0x1" description="PKA is ready"/>
        </bitfield>
        <bitfield id="SHDNIOLOCK" description="SHDNIOLOCK indicates when IO is locked due to SHUTDOWN" begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="IO IS NOT Locked due to SHUTDOWN"/>
            <bitenum id="TRUE" value="0x1" description="IO IS Locked due to SHUTDOWN"/>
        </bitfield>
        <bitfield id="EXTRSTPINDIS" description="EXTRSTPINDIS indicates when user has disabled the use of external reset pin" begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="External Reset Pin Enabled"/>
            <bitenum id="TRUE" value="0x1" description="External Reset Pin Disabled"/>
        </bitfield>
        <bitfield id="VBATGOOD" description="VBATGOOD is set by hardware when the VBAT Power Domain is valid." begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="VBAT Power Domain is not valid"/>
            <bitenum id="TRUE" value="0x1" description="VBAT Power Domain is valid"/>
        </bitfield>
        <bitfield id="PMUIREFGOOD" description="PMUIREFGOOD is set by hardware when the PMU current reference is ready." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="IREF is not ready"/>
            <bitenum id="TRUE" value="0x1" description="IREF is ready"/>
        </bitfield>
        <bitfield id="SWDCFGDIS" description="SWDCFGDIS indicates when user has disabled the use of SWD Port" begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SWD Port Enabled"/>
            <bitenum id="TRUE" value="0x1" description="SWD Port Disabled"/>
        </bitfield>
        <bitfield id="ANACPUMPGOOD" description="ANACPUMPGOOD is set by hardware when the VBOOST analog mux charge pump is ready." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="VBOOST is not ready"/>
            <bitenum id="TRUE" value="0x1" description="VBOOST is ready"/>
        </bitfield>
        <bitfield id="SRAMBANK2READY" description="SRAM BANK2 READY STATE" begin="18" end="18" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK2 is NOT READY for access"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK2 is READY for access"/>
        </bitfield>
        <bitfield id="REBOOTATTEMPTS" description="REBOOTATTEMPTS indicates the number of boot attempts taken before the user application starts." begin="31" end="30" width="2" rwaccess="R">
        </bitfield>
        <bitfield id="SWALTSELEN" description="SWALTSELEN indicates when user has enabled the use of alternate SWD/SWCLK pins" begin="15" end="15" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="Alternate SWD/SWCLK pins are disabled"/>
            <bitenum id="TRUE" value="0x1" description="Alternate SWD/SWCLK pins are enabled"/>
        </bitfield>
        <bitfield id="BORLVL" description="BORLVL indicates if a BOR event occured and the BOR threshold was switched to BOR0 by hardware." begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No BOR violation occured"/>
            <bitenum id="TRUE" value="0x1" description="A BOR violation occured and the BOR threshold was switched to BOR0"/>
        </bitfield>
        <bitfield id="MCAN1READY" description="MCAN1READY indicates when the MCAN1 peripheral is ready." begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="MCAN1 is not ready"/>
            <bitenum id="TRUE" value="0x1" description="MCAN1 is ready"/>
        </bitfield>
        <bitfield id="SRAMBANK3READY" description="SRAM BANK3 READY STATE" begin="19" end="19" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK3 is NOT READY for access"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK3 is READY for access"/>
        </bitfield>
        <bitfield id="MCAN0READY" description="MCAN0READY indicates when the MCAN0 peripheral is ready." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="MCAN0 is not ready"/>
            <bitenum id="TRUE" value="0x1" description="MCAN0 is ready"/>
        </bitfield>
        <bitfield id="FLASHDED" description="FLASHDED indicates if a flash ECC double bit error was detected (DED)." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No flash ECC double bit error detected"/>
            <bitenum id="TRUE" value="0x1" description="Flash ECC double bit error detected"/>
        </bitfield>
        <bitfield id="FLASHSEC" description="FLASHSEC indicates if a flash ECC single bit error was detected and corrected (SEC)." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="No flash ECC single bit error detected"/>
            <bitenum id="TRUE" value="0x1" description="Flash ECC single bit error was detected and corrected"/>
        </bitfield>
        <bitfield id="SRAMBANK1READY" description="SRAM BANK1 READY STATE" begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="SRAM BANK1 is NOT READY for access"/>
            <bitenum id="TRUE" value="0x1" description="SRAM BANK1 is READY for access"/>
        </bitfield>
        <bitfield id="BORCURTHRESHOLD" description="BORCURTHRESHOLD indicates the active brown-out reset supply monitor configuration." begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="BORMIN" value="0x0" description="Default minimum threshold; a BOR0- violation triggers a BOR"/>
            <bitenum id="BORLEVEL1" value="0x1" description="A BOR1- violation generates a BORLVL interrupt"/>
            <bitenum id="BORLEVEL2" value="0x2" description="A BOR2- violation generates a BORLVL interrupt"/>
            <bitenum id="BORLEVEL3" value="0x3" description="A BOR3- violation generates a BORLVL interrupt"/>
        </bitfield>
    </register>
