ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_SHDNIOREL" width="32" offset="0x131C" description="SHUTDOWN IO release control">
        <bitfield id="RELEASE" description="Set RELEASE to release the IO after a SHUTDOWN mode exit." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Release IO"/>
        </bitfield>
    </register>
    <register id="SYSCTL_EXRSTPIN" width="32" offset="0x1320" description="Disable the reset function of the NRST pin">
        <bitfield id="DISABLE" description="Set DISABLE to disable the reset function of the NRST pin.  Once set, this configuration is locked until the next POR." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="Reset function of NRST pin is enabled"/>
            <bitenum id="TRUE" value="0x1" description="Reset function of NRST pin is disabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSSTATUSCLR" width="32" offset="0x1324" description="Clear sticky bits of SYSSTATUS">
        <bitfield id="ALLECC" description="Set ALLECC to clear all ECC related SYSSTATUS indicators." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLEAR" value="0x1" description="Clear ECC error state"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SWDCFG" width="32" offset="0x1328" description="Disable the SWD function on the SWD pins">
        <bitfield id="DISABLE" description="Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Disable SWD function on SWD pins"/>
        </bitfield>
    </register>
    <register id="SYSCTL_FCCCMD" width="32" offset="0x132C" description="Frequency clock counter start capture">
        <bitfield id="GO" description="Set GO to start a capture with the frequency clock counter (FCC)." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE0" width="32" offset="0x1400" description="Shutdown storage memory (byte 0)">
        <bitfield id="PARITYERR" description="Parity error for SHUTDNSTORE0" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DATA" description="Shutdown storage byte 0" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY" description="Parity for SHUTDNSTORE0" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE1" width="32" offset="0x1404" description="Shutdown storage memory (byte 1)">
        <bitfield id="PARITYERR" description="Parity error for SHUTDNSTORE1" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DATA" description="Shutdown storage byte 1" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY" description="Parity for SHUTDNSTORE1" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE2" width="32" offset="0x1408" description="Shutdown storage memory (byte 2)">
        <bitfield id="PARITYERR" description="Parity error for SHUTDNSTORE2" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DATA" description="Shutdown storage byte 2" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY" description="Parity for SHUTDNSTORE2" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE3" width="32" offset="0x140C" description="Shutdown storage memory (byte 3)">
        <bitfield id="PARITYERR" description="Parity error for SHUTDNSTORE3" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DATA" description="Shutdown storage byte 3" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY" description="Parity for SHUTDNSTORE3" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_ADCSEQFRCGB" width="32" offset="0x1410" description="ADC Global Sequence Force">
        <bitfield id="SEQ3" description="Generate synchronous SW trigger for SEQ3" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQ2" description="Generate synchronous SW trigger for SEQ2" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQ0" description="Generate synchronous SW trigger for SEQ0" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQ1" description="Generate synchronous SW trigger for SEQ1" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_ADCSEQFRCGBSEL" width="32" offset="0x1414" description="ADC Global Sequence Force Select">
        <bitfield id="ADCB" description="Generate synchronous SW trigger for ADCB" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCA" description="Generate synchronous SW trigger for ADCA" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_M33SPARESOCLOCK1" width="32" offset="0x1418" description="M33C1 Spare SOC LOCK Reg 1">
    </register>
    <register id="SYSCTL_M33SPARESOCLOCK2" width="32" offset="0x141C" description="M33C1 Spare SOC LOCK Reg 2">
    </register>
    <register id="SYSCTL_SYSCTL_READ_REG" width="32" offset="0x1420" description="Sysctl read only Reg">
    </register>
    <register id="SYSCTL_LIFECYCLE" width="32" offset="0x2000" description="Device Lifecycle">
        <bitfield id="VALUE" description="Device Lifecycle set by BOOTCODE READY=0x96(150), ATTEST=0x55(85), PREPROBE=0x69(105), Others=BAD/DCOM" begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="ATTEST" value="0x55" description="Device in TI Test Mode"/>
            <bitenum id="PREPROBE" value="0x69" description="Device in Pre Probe State"/>
            <bitenum id="READY" value="0x96" description="Device in Product Mode"/>
        </bitfield>
    </register>
    <register id="SYSCTL_BOOTCFG" width="32" offset="0x2004" description="Configuration of CPURESET Vector">
        <bitfield id="BSLREQ" description="0: Full Bringup 1: TRIM already loaded, requesting BSL Entry" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="NONMAINWEPROT" description="0: NonMain Flash area can be modified 1: Program-Erase will be ignored" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BSLEXIT" description="0: Full Bringup 1: TRIM already loaded, requesting BSL Exit" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WAITINRESET" description="0: Normal operation 1: CPU held in reset for debugger to control release" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="STARTVEC" description="Reset Vector target location at next reset" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="BOOTCODE" value="0x0" description="Reset to BOOTCODE"/>
            <bitenum id="BOOTLOADER" value="0x1" description="Reset to BOOTLOADER"/>
            <bitenum id="APPFLASH" value="0x2" description="Reset to FLASH 0x0"/>
            <bitenum id="APPSRAM" value="0x3" description="Reset to SRAM 0x0"/>
        </bitfield>
    </register>
    <register id="SYSCTL_BOOTDONE" width="32" offset="0x2008" description="BOOTCODE PASS">
        <bitfield id="PASS" description="BOOTCODE writes 1 for PASS, left unwritten a timeout will occur if not blocked" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="BOOTCODE PASS"/>
        </bitfield>
    </register>
    <register id="SYSCTL_BOOTTIMEOUT" width="32" offset="0x200C" description="BOOT TIMEOUT Control">
        <bitfield id="STOP" description="BOOTCODE writes 1 for STOPPING BOOT TIMEOUT Counter" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="STOP Bootcode Timeout Counter"/>
        </bitfield>
        <bitfield id="PET" description="BOOTCODE writes 1 for reloading BOOT TIMEOUT Counter" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Restart Bootcode Timeout Counter"/>
        </bitfield>
    </register>
    <register id="SYSCTL_BCTRIMUNLOCK" width="32" offset="0x2010" description="BootCode TRIM Unlock">
    </register>
