ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_INFRASTATUS" width="32" offset="0x2014" description="Infrastructure  Status">
        <bitfield id="SPINUNLOCK" description="SPIN MMRs are UNLOCKED" begin="12" end="12" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DMATRIMSIGFAIL" description="DMA TRIM signiture fail" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="TRIMUNLOCK" description="TRIM MMRs are UNLOCKED" begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SRAMREPAIRDONE" description="SRAM repair is completed or not supported on this SOC" begin="16" end="16" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DBGCSC" description="Debug Of Customer Startup Code is ALLOWED" begin="28" end="28" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="READY1T" description="Flash 1T Read mode is available" begin="24" end="24" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SRAMREPAIRFAIL" description="SRAM repair has failed" begin="17" end="17" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSCTL_BOOTDIAG" width="32" offset="0x2018" description="32 bit boot diagnostic to Debugss">
    </register>
    <register id="SYSCTL_INFRASTATUS1" width="32" offset="0x201C" description="Infrastructure  Status 2">
        <bitfield id="CRPAD" description="Customer Return Pad" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSCTL_FWEPROTMAINA" width="32" offset="0x2020" description="1 Sector Write-Erase per bit starting at address 0x0 of flash">
    </register>
    <register id="SYSCTL_FWEPROTMAINB0" width="32" offset="0x2024" description="8xSector Write-Erase per bit starting at address 0x0 of flash">
    </register>
    <register id="SYSCTL_CSC" width="32" offset="0x2038" description="Customer Startup Code Exists">
        <bitfield id="DISABLE" description="BOOTCODE writes 1 to remove CSC handling, default is CSC exists and will be executed" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="CSC DISABLED"/>
        </bitfield>
    </register>
    <register id="SYSCTL_DBGCSC" width="32" offset="0x203C" description="Debug Customer Startup Code">
        <bitfield id="ON" description="BOOTCODE writes 1 to indicate that Debug Of CSC is available, left unwritten there will be no CSC debug possible" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_JTAGUSERCODE" width="32" offset="0x2040" description="JTAG USERCODE">
    </register>
    <register id="SYSCTL_LFSSCFG" width="32" offset="0x2044" description="LFSS Configuration control">
        <bitfield id="PMUTRIMVALID" description="PMU TRIM For VBAT of LFSS is Valid" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LFCLKTRIMVALID" description="LFCLK TRIM For LFSS is Valid" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SPINCFGBASE" width="32" offset="0x2048" description="SPIN Configuration Offset and Size">
        <bitfield id="OFFSET" description="Offset to start of SPINCFG from TRIMCFG base" begin="11" end="0" width="12" rwaccess="R">
        </bitfield>
        <bitfield id="SZ" description="Size in number of words of SPIN region including SPINCRC" begin="23" end="16" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSCTL_DEVICE_SUBTYPE" width="32" offset="0x204C" description="Device Subtype">
        <bitfield id="VALUE" description="Device Subtype" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="FS" value="0x5555" description="Device is Field Securable"/>
            <bitenum id="FA" value="0x9999" description="Device Failure Analysis"/>
            <bitenum id="KP" value="0xAAAA" description="Device Key Provisioned"/>
            <bitenum id="SE" value="0xABCD" description="Device Security Enforced for all other values"/>
        </bitfield>
    </register>
    <register id="SYSCTL_DMATRIMUNLOCK" width="32" offset="0x2400" description="DMA TRIM Unlock">
    </register>
    <register id="SYSCTL_SYSOSCTRIMBASE" width="32" offset="0x2404" description="SYSOSC Trim Values for frequency when change from disable to enable, generally 32MHz">
        <bitfield id="TRIMVALID" description="TRIM Data Valid- used to trigger FSM" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESCOARSE" description="Resister Coarse TRIM - Changes per frequency target" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="IBIAS" description="IBIAS TRIM - Only 1 value, not frequency dependent" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESFINE" description="Resister Coarse TRIM - Changes per frequency target" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="ILDO" description="ILDO TRIM -- Only 1 value, Not frequency dependent" begin="26" end="24" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="VCTRLSEL" description="VCTRL SEL used potentially needed for FCL mode.  Default 0" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAP" description="CAP TRIM - Changes per frequency target" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUTRIM0" width="32" offset="0x2408" description="PMU TRIM 0">
        <bitfield id="REFIREF" description="Reference IREF TRIM" begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM0" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM0" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="REFSLOPEB0" description="Reference Slope TRIM Bit0" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUTRIM1" width="32" offset="0x240C" description="PMU TRIM 1">
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM1" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="REFMAGB2B0" description="Reference MAG TRIM Bit2_0" begin="7" end="5" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM1" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="REFSLOPEB5B1" description="Reference Slope TRIM Bit5_1" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUTRIM2" width="32" offset="0x2410" description="PMU TRIM 2">
        <bitfield id="REFMAGB5B3" description="Reference MAG TRIM Bit5_3" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="REFFLASHPROG" description="Reference Flash Programming" begin="5" end="3" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM2" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM2" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SPARETRIM1" description="SPARE TRIM 1" begin="7" end="6" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUTRIM3" width="32" offset="0x2414" description="PMU TRIM 3">
        <bitfield id="BORRTRMSMPB1B0" description="BOR R-TRIM for Sampled mode1_0" begin="7" end="6" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="BORRTRMACT" description="BOR R-TRIM for Active mode" begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM3" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM3" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
