ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_PMUTRIM5" width="32" offset="0x2418" description="PMU TRIM 5">
        <bitfield id="SPARETRIM2" description="SPARE TRIM 2" begin="7" end="3" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM5" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM5" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="VCORELDO_RUN" description="Voltage Setting for RUN mode" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUTRIM6" width="32" offset="0x241C" description="PMU TRIM 6">
        <bitfield id="SPARETRIM3" description="SPARE TRIM 3" begin="7" end="6" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="VCORELDO_RETFF" description="Voltage Setting for retention flop during STOP mode" begin="5" end="3" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM6" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="VCORELDO_STOP" description="Voltage Setting for 10 percent OPP in STOP-STANDBY mode" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM6" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUTRIM4" width="32" offset="0x2420" description="PMU TRIM 4">
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM4" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="BORRTRMSMPB5B2" description="BOR R-TRIM for Sampled mode5_2" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM4" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="BORCTRMSMP" description="BOR C-TRIM for Sampled mode3_0" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUTRIM7" width="32" offset="0x2424" description="PMU TRIM 7">
        <bitfield id="SYSOSCSPARE" description="Sysosc LDO Spare TRIM" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARITYERR" description="Parity Error for PMUTRIM7" begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PARITY" description="Parity for PMUTRIM7" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PMUCOREVTRIM0" width="32" offset="0x2428" description="PMU CORE VOLTAGE TRIM 0">
        <bitfield id="LDOSPARE" description="LDO RUN SPARE" begin="12" end="9" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDORUNCLAMPDIS" description="LDO RUN CLAMP DIS" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDORUNCOMPPROG" description="LDO RUN COMP PROG" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDORUNSINKEN" description="LDO RUN SINK EN" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDORUNIQQPROG" description="LDO RUN IQQ PROG" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDORUNINRUSHPROG" description="LDO RUN INRUSH PROG" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FLASHPUMPTRIML" width="32" offset="0x242C" description="Flash Pump TRIM-CFG Bits 31...0">
    </register>
    <register id="SYSCTL_FLASHPUMPTRIMH" width="32" offset="0x2430" description="Flash Pump TRIM-CFG Bits 39...32">
        <bitfield id="DATA" description="Flash IP determines usage" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FLASHBANK0TRIM" width="32" offset="0x2434" description="$btname TRIM-CFG">
    </register>
    <register id="SYSCTL_FLASHBANK0MPTRIM" width="32" offset="0x2438" description="$brname Flash MP Trim">
        <bitfield id="DATA" description="MP Trim Bits" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FLASHBANK0REPAIR" width="32" offset="0x243C" description="$brname Flash Repair">
        <bitfield id="DATA" description="Repair Bits" begin="27" end="0" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FLASHBANK1TRIM" width="32" offset="0x2440" description="$btname TRIM-CFG">
    </register>
    <register id="SYSCTL_FLASHBANK1MPTRIM" width="32" offset="0x2444" description="$brname Flash MP Trim">
        <bitfield id="DATA" description="MP Trim Bits" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FLASHBANK1REPAIR" width="32" offset="0x2448" description="$brname Flash Repair">
        <bitfield id="DATA" description="Repair Bits" begin="27" end="0" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FLASHBANK2TRIM" width="32" offset="0x244C" description="$btname Data Bank TRIM-CFG">
    </register>
    <register id="SYSCTL_FLASHBANK2MPTRIM" width="32" offset="0x2450" description="$brname Flash MP TRIM">
        <bitfield id="DATA" description="Data Bank MP TRIM Bits" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FLASHBANK2REPAIR" width="32" offset="0x2454" description="$brname Flash Repair">
        <bitfield id="DATA" description="Data Bank Repair Bits" begin="27" end="0" width="28" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SRAMREPAIR0" width="32" offset="0x2458" description="SRAM Repair 1">
    </register>
    <register id="SYSCTL_SRAMREPAIR" width="32" offset="0x245C" description="SRAM Repair">
    </register>
    <register id="SYSCTL_FLASHSRAMCFG" width="32" offset="0x2460" description="Flash and SRAM Configuration">
        <bitfield id="FLTRIMDONE" description="1: Flash TRIM bits loaded  0: TRIM unwritten" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SRAMTIMING" width="32" offset="0x2464" description="SRAM timing MMR for ESRAM controller, based on 4MHz">
        <bitfield id="PWRSWITCHFRCON" description="Debug option to force SVT SRAM PWR Switches always on" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TISORISE2XONFALL" description="ISO Rise to any ON FALL, spec 500ns (boot 750ns)" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TPGOODRISE2ISOFALL" description="PGOOD RISE to ISO FALL, spec 750ns (boot 1500ns)" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="TISOGOODFALL2CLKRISE" description="ISO GOOD FALL to CLKRISE, spec 250ns (boot 500ns)" begin="15" end="12" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="PONOUT2PGOODINCFGDLY" description="Programmable delay for power switch PONOUT to PGOODIN" begin="21" end="17" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="TSTRONG" description="Driver Weak to Stong timing, spec 1000ns (boot 1500ns)" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_MCORELDOCFG" width="32" offset="0x2468" description="LDO Voltage Settings">
        <bitfield id="STOP2RUNDLY" description="Delay value in usec for STOP voltage to STEP voltage" begin="27" end="24" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSOSCTRIM4MHZ" width="32" offset="0x246C" description="SYSOSC Trim Values for 4MHz target">
        <bitfield id="RESCOARSE" description="Resister Coarse TRIM - Changes per frequency target" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESFINE" description="Resister Coarse TRIM - Changes per frequency target" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAP" description="CAP TRIM - Changes per frequency target" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSOSCTRIM4MHZFCL" width="32" offset="0x2470" description="SYSOSC Trim Values for 4MHz target with FCL enabled">
        <bitfield id="RESCOARSE" description="Resister Coarse TRIM - Changes per frequency target" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESFINE" description="Resister Coarse TRIM - Changes per frequency target" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="RDIV" description="FCL RDIV TRIM - Changes per frequency target" begin="28" end="20" width="9" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAP" description="CAP TRIM - Changes per frequency target" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSOSCTRIMBASEFCL" width="32" offset="0x2474" description="SYSOSC Trim Values for 32MHz target with FCL enabled">
        <bitfield id="RESCOARSE" description="Resister Coarse TRIM - Changes per frequency target" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESFINE" description="Resister Fine TRIM - Changes per frequency target" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="FCLOTAIBIAS" description="FCL IBIAS TRIM, Not frequency dependent" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="RDIV" description="FCL RDIV TRIM - Changes per frequency target" begin="28" end="20" width="9" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAP" description="CAP TRIM - Changes per frequency target" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_LFOSCTRIM0" width="32" offset="0x2478" description="LFOSC TRIM values">
        <bitfield id="CCODE" description="LFOSC Cap Frequency Trim" begin="12" end="8" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="RCODE" description="LFOSC Res Frequency Trim" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_LFOSCTRIM1" width="32" offset="0x247C" description="LFOSC TRIM values">
        <bitfield id="GFCFG" description="LFXT GFCFG - This is hardwired 0 if no LFXT present" begin="31" end="29" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="RSHIFT" description="LFOSC RSHIFT Trim" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RTN" description="LFOSC Noise Trim" begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="CFG" description="LFOSC CFG Trim" begin="14" end="0" width="15" rwaccess="R/W">
        </bitfield>
        <bitfield id="CLKSEL" description="0: divide LFOSC by 2 to give 32KHz, 1: pass through 64KHz" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MUXCFG" description="LFOSC Mux CFG Trim" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_LFXTTRIM" width="32" offset="0x2480" description="LFXT TRIM values">
        <bitfield id="MANTRIMLOWER" description="LFXT Man Reg Trim Lower Power" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="LKCOMPDISABLE" description="LFXT Leakage Comp Disable" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MAININV" description="LFXT Main Inverter Strength" begin="29" end="28" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="FASTSTARTUP" description="LFXT Fast Startup Select" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SWSUPPLYEN" description="LFXT SW Supply Enable" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="MANTRIMLOWEST" description="LFXT Man Reg Trim Lowest Power" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="MANTRIMHIGHER" description="LFXT Man Reg Trim Higher Power" begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="STARTUPTIME" description="LFXT Startup Time" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="HYSCFG" description="LFXT Hysterisys Config" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="GLITCHFILTER" description="Glitch Filter Enable" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="MONITOROFFTIME" description="XT Monitor Off Time Trim" begin="31" end="30" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="MANTRIMHIGHEST" description="LFXT Man Reg Trim Highest Power" begin="15" end="12" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_HFXTTRIM0" width="32" offset="0x2484" description="HFXT TRIM and Override">
        <bitfield id="MAGR0" description="Value for MAG TRIM Range 0" begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="KICKSTARTDISABLE" description="DISABLE Kickstart" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="MAGOVERRIDE" description="Use this TRIM value instead of hardwired" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="MAGR2" description="Value for MAG TRIM Range 2" begin="21" end="16" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="MAGR3" description="Value for MAG TRIM Range 3" begin="29" end="24" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="MAGR1" description="Value for MAG TRIM Range 1" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_HFXTTRIM1" width="32" offset="0x2488" description="HFXT TRIM and Override">
        <bitfield id="DRVR0" description="Value for DRV TRIM Range 0" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="DRVR2" description="Value for DRV TRIM Range 2" begin="23" end="16" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="DRVR3" description="Value for DRV TRIM Range 3" begin="31" end="24" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="DRVR1" description="Value for DRV TRIM Range 1" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PLLTRIM0" width="32" offset="0x248C" description="PLL TRIM and Override">
        <bitfield id="VCOSTARTTIME" description="VCO Start Settling Time in HFXT 48MHz - this comes before STARTTIME-STARTTIMELP" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEARCHITER" description="Search iterations to perform" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="OneIteration" value="0x0" description=""/>
            <bitenum id="TwoIteration" value="0x1" description=""/>
            <bitenum id="ThreeIteration" value="0x2" description=""/>
            <bitenum id="FourIteration" value="0x3" description=""/>
        </bitfield>
        <bitfield id="LPFVCOVTUNE" description="LPF VCOVTUNE NOM Value" begin="20" end="16" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="VCOJUMPTIME" description="VCO Freq Jump Settling Time" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEARCHALGO" description="Select Search Mode Algorithm" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="ALG1" value="0x0" description=""/>
            <bitenum id="ALG2" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SEARCHALWAYS" description="Force Freq Search to ALWAYS be performed" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
