ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_PLLTRIM1" width="32" offset="0x2490" description="PLL TRIM and Override">
        <bitfield id="IDACSTART" description="IDAC Start Value" begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
        <bitfield id="CLKGATEBPASS" description="Clock Gating Bypass added to SPARE MMR bit 1 port" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="IDACOFFSET" description="IDAC Offset Value" begin="14" end="8" width="7" rwaccess="R/W">
        </bitfield>
        <bitfield id="EXCHG1X2X" description="Exchange 1X and 2X clock paths - Experimental" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="CPSCALE" description="CP Scale added to SPARE MMR bit 0 port" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="VCOIDACOVRDEN" description="VCO Feq IDAC mcode override enable" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="VCOIDACOVRDVAL" description="VCO Feq IDAC mcode override val" begin="22" end="16" width="7" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_M33ADC12B0INLTRIM0" width="32" offset="0x2494" description="Bits 31..0 of ADC INL TRIM Instance 0">
    </register>
    <register id="SYSCTL_M33ADC12B0INLTRIM1" width="32" offset="0x2498" description="Bits 62..32 of ADC INL TRIM Instance 0">
        <bitfield id="VALUE" description="Bits 62..32 of ADC INL TRIM" begin="30" end="0" width="31" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_M33ADC12B0OFFSETTRIM" width="32" offset="0x249C" description="Bits 7..0 of ADC OFFSET TRIM Instance 0">
        <bitfield id="VALUE" description="Bits 62..32 of ADC OFFSET TRIM" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_M33ADC12B1INLTRIM0" width="32" offset="0x24A0" description="Bits 31..0 of ADC INL TRIM Instance 0">
    </register>
    <register id="SYSCTL_M33ADC12B1INLTRIM1" width="32" offset="0x24A4" description="Bits 62..32 of ADC INL TRIM Instance 0">
        <bitfield id="VALUE" description="Bits 62..32 of ADC INL TRIM" begin="30" end="0" width="31" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_M33ADC12B1OFFSETTRIM" width="32" offset="0x24A8" description="Bits 7..0 of ADC OFFSET TRIM Instance 1">
        <bitfield id="VALUE" description="Bits 62..32 of ADC OFFSET TRIM" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_ANACOMPTRIM" width="32" offset="0x24AC" description="Common Trims for Anacomp">
        <bitfield id="TSRDYCNT" description="TempSense Ready Count in 1 usec resolution" begin="29" end="24" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="RDYCNT" description="Ready Count in 1 usec resolution" begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="DACMODE0RDYCNT" description="DAC Ready Count in 250ns usec resolution" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="DACMODE1RDYCNT" description="DAC Ready Count in 1 usec resolution" begin="21" end="16" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_TRNGTRIM" width="32" offset="0x24B0" description="Trim for TRNG">
        <bitfield id="VLDO" description="TRNG VLDO TRIM" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="PULSEDELAY" description="TRNG Pulse Delay TRIM" begin="13" end="12" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="V2ICURRENT" description="TRNG V2i Current TRIM" begin="15" end="14" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="AMPCURRENT" description="TRNG Amp Current TRIM" begin="10" end="8" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="PULSERES" description="TRNG Pulse Res TRIM" begin="7" end="6" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="CPCURRENT" description="TRNG CP Current TRIM" begin="22" end="20" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="VCMNOISE" description="TRNG VCM Noise TRIM" begin="25" end="24" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="VCMPUMP" description="TRNG VCM Pump TRIM" begin="3" end="2" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="IREF" description="TRNG IREF TRIM" begin="18" end="16" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDOCURRENT" description="TRNG LDO Current TRIM" begin="5" end="4" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_MISCTRIM" width="32" offset="0x24B4" description="Various Small TRIM">
        <bitfield id="ANAFLTRIS" description="Analog GlitchFilter Rising Trim" begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="ANAFLTFALL" description="Analog GlitchFilter Falling Trim" begin="20" end="16" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="SYSOSCIBIASTRIMSTOP" description="IBIAS TRIM - in STOP mode, oscillator accuracy" begin="12" end="9" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="REFBUFENBORMASKEN" description="BOR Mask Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BORMASKDISABLE" value="0x0" description="BOR Masking disabled when REFBUF is enabled"/>
            <bitenum id="BORMASKENABLE" value="0x1" description="BOR Masking enabled when REFBUF is enabled"/>
        </bitfield>
        <bitfield id="SAMPLETIMEPROG" description="PMU Sample Time Programmability TRIM for STANDBY Mode" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SMPLTIME1CLOCK" value="0x0" description="Sample Time is 1 Clock"/>
            <bitenum id="SMPLTIME2CLOCKS" value="0x1" description="Sample Time is 2 Clocks"/>
        </bitfield>
        <bitfield id="PMUSMPLMODE" description="PMU REF/BOR Sample Periode TRIM for STANDBY Mode" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="SMPL8MS" value="0x0" description="Sample Periode is 8ms"/>
            <bitenum id="SMPL16MS" value="0x1" description="Sample Periode is 16ms"/>
            <bitenum id="SMPL32MS" value="0x2" description="Sample Periode is 32ms"/>
            <bitenum id="SMPL48MS" value="0x3" description="Sample Periode is 48ms"/>
            <bitenum id="SMPL64MS" value="0x4" description="Sample Periode is 64ms"/>
            <bitenum id="SMPL80MS" value="0x5" description="Sample Periode is 80ms"/>
            <bitenum id="SMPL100MS" value="0x6" description="Sample Periode is 100ms"/>
            <bitenum id="SMPL125MS" value="0x7" description="Sample Periode is 125ms"/>
        </bitfield>
        <bitfield id="REFONTIMEPROG" description="PMU Ref On Time Programmability TRIM for STANDBY Mode" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="REFONTIME3CLOCKS" value="0x0" description="Ref On Time is 3 Clocks"/>
            <bitenum id="REFONTIME4CLOCKS" value="0x1" description="Ref On Time is 4 Clocks"/>
            <bitenum id="REFONTIME5CLOCKS" value="0x2" description="Ref On Time is 5 Clocks"/>
            <bitenum id="REFONTIME6CLOCKS" value="0x3" description="Ref On Time is 6 Clocks"/>
        </bitfield>
    </register>
    <register id="SYSCTL_MISCRDYCNT" width="32" offset="0x24B8" description="Various Small RDY CNT or other familiy TRIM">
        <bitfield id="AFEVREFRDYCNT" description="VREF Ready Count Nano is in 1 usec, Micro in 8 usec resolution" begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="AFEVREF" description="VREF TRIM" begin="18" end="16" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADCRDYCNT" description="Ready Count in 1 usec resolution" begin="24" end="20" width="5" rwaccess="R/W">
        </bitfield>
    </register>
