ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_SYSOSCTRIMBASEEXRES" width="32" offset="0x24BC" description="SYSOSC Trim Values for BASE frequency external resistor FCL">
        <bitfield id="RESCOARSE" description="External Resistor feature Not used" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESFINE" description="External Resistor feature Not used" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="RDIV" description="External Resistor feature Not used" begin="28" end="20" width="9" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAP" description="External Resistor feature Not used" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSOSCTRIM4MHZEXRES" width="32" offset="0x24C0" description="SYSOSC Trim Values for 4MHz frequency external resistor FCL">
        <bitfield id="RESCOARSE" description="External Resistor feature Not used" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="RESFINE" description="External Resistor feature Not used" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="RDIV" description="External Resistor feature Not used" begin="28" end="20" width="9" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAP" description="External Resistor feature Not used" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_ANACOMP0TRIM" width="32" offset="0x24C4" description="Per Instance TRIM for ANACOMP0">
        <bitfield id="DATA" description="TRIM value" begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_ANACOMP1TRIM" width="32" offset="0x24C8" description="Per Instance TRIM for ANACOMP1">
        <bitfield id="DATA" description="TRIM value" begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_VBATPMUTRIM0" width="32" offset="0x24CC" description="VBAT PMU TRIM lower 32bits">
    </register>
    <register id="SYSCTL_VBATPMUTRIM1" width="32" offset="0x24D0" description="VBAT PMU TRIM Bits 42-32">
        <bitfield id="DATA" description="Bits 42-32 VBAT PMU TRIM" begin="10" end="0" width="11" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_M33C1SPARETRIM1" width="32" offset="0x24D4" description="M33C1 Spare TRIM1">
    </register>
    <register id="SYSCTL_M33C1SPARETRIM2" width="32" offset="0x24D8" description="M33C1 Spare TRIM2">
    </register>
    <register id="SYSCTL_ULLSYSOSC" width="32" offset="0x24DC" description="SYSOSC Spare TRIM">
        <bitfield id="SPARE" description="Sysosc Spare Trim" begin="2" end="0" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_M33C1SPAREREG" width="32" offset="0x24E0" description="Spare Register Read only">
    </register>
    <register id="SYSCTL_PROBECRC" width="32" offset="0x24E4" description="FINAL 32 bit CRC of the PROBE TRIM load">
    </register>
    <register id="SYSCTL_SPINUNLOCK" width="32" offset="0x24E8" description="SPIN Region Unlock Signiture: 0x5F689B9D always reads this value">
    </register>
    <register id="SYSCTL_MEMSPIN" width="32" offset="0x24EC" description="Flash and SRAM Configuration">
        <bitfield id="FLSIZE" description="Flash Paper Spin 0: Full size, 1: 1/2, 2: 1/4" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="SRSIZE" description="SRAM Paper Spin 0: Full size, 1: 1/2, 2: 1/4" begin="5" end="4" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="MAIN2T" description="1: Main (nonmain) are 2T access  0: Main (nonmain) are 1T access" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_PADNOTAVAIL0" width="32" offset="0x24F0" description="PAD Exist for IOMUX">
    </register>
    <register id="SYSCTL_PADNOTAVAIL1" width="32" offset="0x24F4" description="PAD Exist for IOMUX">
    </register>
    <register id="SYSCTL_PADNOTAVAIL2" width="32" offset="0x24F8" description="PAD Exist for IOMUX">
        <bitfield id="DATA" description="Padexists Vector bits- 0: Pad Available 1: Pad Not Available" begin="28" end="0" width="29" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_IPAVAIL0" width="32" offset="0x24FC" description="IP Available Paper Spin">
        <bitfield id="timg0" description="Bit field is not used" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="timg12" description="Bit field is not used" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="qspi" description="Bit field is not used" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="i2s0" description="Bit field is not used" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="gpio2" description="Bit field is not used" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="gpio0" description="Bit field is not used" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="timg2" description="Bit field is not used" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="m33adc12b4msps1" description="Bit field is not used" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="tima0" description="Bit field is not used" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="pka" description="Peripheral  Instance Available" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="crc0" description="Peripheral  Instance Available" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="i2s1" description="Bit field is not used" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="timg8" description="Bit field is not used" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="shaw" description="Peripheral  Instance Available" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="timg9" description="Bit field is not used" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="m33adc12b4msps0" description="Bit field is not used" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s1u0_unicomm" description="Bit field is not used" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="aes" description="Bit field is not used" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="gpio1" description="Bit field is not used" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="tima1" description="Bit field is not used" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="trng" description="Bit field is not used" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="timg1" description="Bit field is not used" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="anacomp1" description="Bit field is not used" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="vref" description="Bit field is not used" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="mcan0" description="Peripheral  Instance Available" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s1u2_unicomm" description="Bit field is not used" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s0u2_unicomm" description="Bit field is not used" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="timg3" description="Bit field is not used" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s0u1_unicomm" description="Bit field is not used" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="mcan1" description="Peripheral  Instance Available" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="wwdtlp0" description="Bit field is not used" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="anacomp0" description="Bit field is not used" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_IPAVAIL1" width="32" offset="0x2500" description="IP Available Paper Spin">
        <bitfield id="s2u2_unicomm" description="Peripheral  Instance Available" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s2u1_unicomm" description="Peripheral  Instance Available" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s2u0_unicomm" description="Peripheral  Instance Available" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s1u4_unicomm" description="Peripheral  Instance Available" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s2u3_unicomm" description="Peripheral  Instance Available" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s1u5_unicomm" description="Peripheral  Instance Available" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="s1u3_unicomm" description="Peripheral  Instance Available" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOTAVAILABLE" value="0x0" description=""/>
            <bitenum id="AVAILABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_FUNCPSPIN" width="32" offset="0x2504" description="Functional Paper Spin Options">
        <bitfield id="MCANFD" description="MCAN FD enabled" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_TRIMCRC" width="32" offset="0x2508" description="FINAL 32 bit CRC of the SPIN load">
    </register>
    <register id="SYSCTL_DFTSYSOSC" width="32" offset="0x2C00" description="DFT Control for SYSOSC">
        <bitfield id="ATBCTL" description="ATB Control - Direct to MSIP" begin="15" end="12" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="ENVAL" description="Override Value for the functional Enable into the MSIP" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DIRECTTRIMVALID" description="TRIMVALID MSIP input value when DIRECTTRIMS is 1" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FCLVAL" description="Override Value for the functional FCL Enable into the MSIP" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTBEN" description="Enable DTB Structure - Direct to MSIP" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="DIRECTFCLDIV" description="FCL DIV value when DIRECTTRIMS is 1" begin="23" end="21" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="DBUGCTL" description="Debug Control - Direct to MSIP" begin="9" end="8" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="FCLOVRRIDE" description="Override the functional FCL Enable with FCLVAL into the MSIP" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ATBEN" description="Enable ATB Structure - Direct to MSIP" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="ENOVRRIDE" description="Override the functional Enable with ENVAL into the MSIP" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SYSOSCLDODBUGCTL" description="SYSOSC LDO DBUG CTL Direct to MSIP" begin="30" end="25" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="DIRECTTRIMS" description="MUX SYSOSCBASE MMR values directly to MSIP input and hold SWITCHFREQ 1" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
    </register>
