ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_DFTLFCLK" width="32" offset="0x2C04" description="DFT Control for LFCLK Hard Macro">
        <bitfield id="DTBSELUPPER" description="DTB Select for Upper 4 bits of DTBO[11:0] of hard macro" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LFOSCEN" description="Value for LFOSC_EN when LFENOVERRIDE is set" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DLYTRIMEN" description="WHEN DLYTRIMOVRD - DLYTRIMEN - ELSE 1 for Delay Cell Trim Enable" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="USEEXLF" description="Value for USEEXLF when LFENOVERRIDE is set" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LFXTEN" description="Value for LFXT_EN when LFENOVERRIDE is set" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DLYTESTEN" description="WHEN DLYTRIMOVRD - DLYTESTEN - ELSE 0 for Delay Cell Test Enable" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LFENOVERRIDE" description="Override the functional LFOSC - LFXT enable" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTBSEL" description="DTB Select at hard macro - Direct to MSIP" begin="3" end="2" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="DLYTRIMOVRD" description="Delay Cell Trim OVERRIDE control" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DLYTESTCTL" description="Delay Cell Test CTL - Direct to MSIP" begin="19" end="16" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="ATB" description="Bit1: enables buffered path, Bit0 enables unbuffered path - Direct to MSIP" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="USELFXT" description="Value for USELFXT when LFENOVERRIDE is set" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ATBBUFSEL" description="ATB Buffered Signal Select - Direct to MSIP" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="ATBUNBUFSEL" description="ATB Buffered Signal Select - Direct to MSIP" begin="9" end="8" width="2" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_DFTVBSTCP" width="32" offset="0x2C08" description="DFT for VBOOST Charge Pump">
        <bitfield id="BYPFILTER" description="No filter makes power up faster" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BYPCLKSEL" description="CP Clock Select" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="CLK4MHZ" value="0x0" description=""/>
            <bitenum id="CLK32KHZ" value="0x2" description=""/>
            <bitenum id="DTBI0" value="0x3" description=""/>
        </bitfield>
        <bitfield id="BYPASS" description="Override enable for BYPCLKMUL, BYPFILTER, BYPEN, BYPCLKSEL" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ATBEN" description="This forces CPUMP enabled as part of the larger enable equation it is not the dedicated override" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BYPEN" description="EN to Hard Macro" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BYPCLKMUL" description="Multiply CP clk by 8" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTHFXT" width="32" offset="0x2C10" description="DFT Control for HFXT">
        <bitfield id="ICG" description="Override value when FSMOVERRIDE to turn HFCLK related ICGs ON qualified with HFCLKSEL" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SLICERDISABLE" description="Turn off slicer - Direct to MSIP" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="USEDTBI0" description="Use DTBI[0] as the HFCLK output - does not require FSMOVERRIDE" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FSMOVERRIDE" description="Override outputs of HFCLK FSM-ATTEST must also be TRUE" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ATB" description="Enable ATB Structure - Direct to MSIP" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="HFXTEN" description="Override value when FSMOVERRIDE for HFXT ENABLE to Hard Macro" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ATBBUFSEL" description="ATB Buffered Signal Select - Direct to MSIP" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="ATBUNBUFSEL" description="ATB Buffered Signal Select - Direct to MSIP" begin="10" end="8" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="HFCLKSEL" description="Override value when FSMOVERRIDE for High Frequency Oscillator Source(HFCLK)" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="HFXT" value="0x0" description=""/>
            <bitenum id="EXTHF" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTSYSPLL0" width="32" offset="0x2C20" description="DFT Control for SYSPLL">
        <bitfield id="VCOIDACVAL" description="Override Value For VCO Freq Idac Code - Direct to MSIP" begin="25" end="20" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTBSEL" description="DTB Signal Select - Direct to MSIP" begin="14" end="12" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTB" description="Enable DTB Structure - Direct to MSIP" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="VCOIDACOVERRIDE" description="Override Enable For VCO Freq Idac Code - Direct to MSIP" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ATB" description="Enable ATB Structure - Direct to MSIP" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ATBBUFSEL" description="ATB Buffered Signal Select - Direct to MSIP" begin="6" end="4" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="ATBUNBUFSEL" description="ATB UnBuffered Signal Select - Direct to MSIP" begin="10" end="8" width="3" rwaccess="R/W">
        </bitfield>
    </register>
