ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/SYSCTL_1.0.xml
    <register id="SYSCTL_DFTSYSPLL1" width="32" offset="0x2C24" description="DFT Control for SYSPLL">
        <bitfield id="PDISO" description="Override value when FSMOVERRIDE Assert ISO PD to the hard macro" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DEASSERT" value="0x0" description=""/>
            <bitenum id="ASSERT" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PLLEN" description="Override value when FSMOVERRIDE for PLL ENABLE to PLL" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PDRST" description="Override value when FSMOVERRIDE Assert RST PD to the hard macro" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DEASSERT" value="0x0" description=""/>
            <bitenum id="ASSERT" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FSMOVERRIDE" description="Override outputs of PLL FSM-ATTEST must also be TRUE" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ICG0" description="Override value when FSMOVERRIDE Override value to turn PLL ICGCLK0 ON" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ONDOMAINRST" description="Override value when FSMOVERRIDE Assert ONDOMAIN RST to the hard macro" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DEASSERT" value="0x0" description=""/>
            <bitenum id="ASSERT" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LDOATBENLOWV" description="LDO ATB mux enable - Direct to MSIP" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="REFCLKSEL" description="Override value when FSMOVERRIDE Override value to select Ref Clk" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="SYSOSC" value="0x0" description=""/>
            <bitenum id="HFCLK" value="0x1" description=""/>
            <bitenum id="DTBI0" value="0x2" description=""/>
        </bitfield>
        <bitfield id="ICG1" description="Override value when FSMOVERRIDE Override value to turn PLL ICGCLK1 ON" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LDOATBSELLOWV" description="LDO ATB mux selection - Direct to MSIP" begin="19" end="12" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="PLLLDOEN" description="Override value when FSMOVERRIDE for PLL LDO ENABLE to PLL" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="ICG2X" description="Override value when FSMOVERRIDE Override value to turn PLL ICGCLK2X ON" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTPMUATB" width="32" offset="0x2C40" description="DFT Control for PMU ATB">
        <bitfield id="UBUF2BUFEN" description="" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SENSEMUXSEL" description="" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="UNBUFOUTSWEN" description="" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BUFMUXSEL" description="" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BUFFEREN" description="" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SENSEEN" description="" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="UBUFMUXSEL" description="" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BYPASSSWEN" description="" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BUFEN" description="ATB Buffered Output Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BUFFERMDSEL" description="" begin="10" end="8" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="BUFFERFB" description="" begin="13" end="12" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="UBUF2BUFPADEN" description="" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="UBUFEN" description="ATB UnBuffered Output Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BUFOUTSWEN" description="" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTPMUCTL" width="32" offset="0x2C44" description="DFT Control for PMU CTL">
        <bitfield id="PMUBUFEN" description="ATB Buffered Output Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LDOCOMPEN" description="" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LDODISLDO" description="" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUBUFCTRL5" description="" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDODISPD" description="" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUUBUFCTRL" description="" begin="9" end="6" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="BORRDIVPD" description="" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUUBUFCTRL5" description="" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDOENCLAMP" description="" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="DTBOSEL" description="" begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="BORDISHYS" description="" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="REFCHOPCFG" description="" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="REFEXTBGSEL" description="" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PARDIS" description="" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUUBUFEN" description="ATB UnBuffered Output Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORDISRST" description="" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORDISSMPL" description="" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORCTOPFLIP" description="" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUBUFCTRL" description="" begin="5" end="2" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="PARBYPASS" description="" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="DFTPORREQ" description="" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTPMULPM" width="32" offset="0x2C48" description="DFT Control for PMU LPM">
        <bitfield id="OVRDEN" description="" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FORCERUN" description="" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FORCESTOP" description="" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FORCESTDBY" description="" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORVTH" description="" begin="5" end="4" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDOCTL" description="" begin="9" end="6" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_DFTVBATPMUCTL" width="32" offset="0x2C4C" description="DFT Control for PMU CTL">
        <bitfield id="FORCERUN" description="" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUBUFEN" description="ATB Buffered Output Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="VDETISODIS" description="" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LDOCOMPEN" description="" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LDODISLDO" description="" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FORCESTDBY" description="" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LDODISPD" description="" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUUBUFCTRL" description="" begin="9" end="6" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="BORRDIVPD" description="" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="DTBOSEL" description="" begin="31" end="30" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="BORDISHYS" description="" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="REFCHOPCFG" description="" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="REFEXTBGSEL" description="" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUUBUFEN" description="ATB UnBuffered Output Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORDISRST" description="" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORDISSMPL" description="" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORCTOPFLIP" description="" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="PMUBUFCTRL" description="" begin="5" end="2" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="LDOCTL" description="" begin="29" end="24" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="DFTPORREQ" description="" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTVBATCTL" width="32" offset="0x2C50" description="DFT Control for VBAT POR">
        <bitfield id="POR2PADEN" description="DFT VBAT POR control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTSRAMREPCLR" width="32" offset="0x2C58" description="Clear SRAM Repair Data">
        <bitfield id="MANCLR" description="Send CLR to SRAM Banks" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTPMCU" width="32" offset="0x2C60" description="Overall PMCU DFT Controls">
        <bitfield id="DTBOB0CLKSEL" description="DFT selections for OTHERCLKS bit 0 of DTB" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="VBST4MHZCLK" value="0x0" description=""/>
            <bitenum id="PMUCHOPCLK" value="0x1" description=""/>
            <bitenum id="FINALVBSTCLK" value="0x2" description=""/>
            <bitenum id="FUNCEXTCLK" value="0x3" description=""/>
        </bitfield>
        <bitfield id="EXCLKDIVB43" description="Extends the EXCLK divider by 2 MSB to give div64" begin="11" end="10" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="DTBI0ASLFCLK" description="Use DTBI0 as the LFCLK source" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FCCOVRDCLKSEL" description="DFT selections for CLK source of counter" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="FCCSELCLK" value="0x0" description=""/>
            <bitenum id="DTBI0" value="0x1" description=""/>
            <bitenum id="ADC0OSCLK" value="0x2" description=""/>
            <bitenum id="ADC1OSCLK" value="0x3" description=""/>
            <bitenum id="RAWSYSOSC" value="0x4" description="Directly from MSIP"/>
        </bitfield>
        <bitfield id="FCCDTBI1TRIG" description="Use DTBI1 as the trigger" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="FCCEXCLKTRIG" description="Use EXCLK as the trigger" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description=""/>
        </bitfield>
        <bitfield id="DTBOSEL" description="Major DTB Output Select" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="PMU" value="0x0" description=""/>
            <bitenum id="SYSPLL" value="0x1" description=""/>
            <bitenum id="LFCLK" value="0x2" description=""/>
            <bitenum id="OTHERCLKS" value="0x3" description=""/>
            <bitenum id="SYSOSC" value="0x4" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_DFTSRAMREPSHFT0" width="32" offset="0x2C70" description="Shift SRAM Repair Preamble Read-Only">
    </register>
    <register id="SYSCTL_DFTSRAMREPSHFT" width="32" offset="0x2C78" description="Shift SRAM Repair Preamble Read-Only">
    </register>
    <register id="SYSCTL_MGMT_M33ADC12B4MSPS1_PWREN" width="32" offset="0x2800" description="IP Enable Register">
        <bitfield id="ENABLE" description="IP Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Disable" value="0x0" description=""/>
            <bitenum id="Enable" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_M33ADC12B4MSPS1_RSTCTL" width="32" offset="0x2804" description="Power Control Register - Write Only Register, Always Read as 0">
        <bitfield id="RESETSTKYCLR" description="Clear the RESET STICKY Bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="Clear" value="0x1" description=""/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert Reset to IP Domain." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="Do" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_MGMT_M33ADC12B4MSPS1_STAT" width="32" offset="0x2814" description="IP State Register - Read Only">
        <bitfield id="RESETSTKY" description="IP has been Reset" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="clear" value="0x0" description=""/>
            <bitenum id="Set" value="0x1" description=""/>
        </bitfield>
    </register>
